app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
---
  def index
    @photo = Photo.new
    @photos = Photo.all

SELECT "comments".* FROM "comments"  WHERE "comments"."photo_id" = ?  [["photo_id", 7]]
---
  def show
    @comments = @photo.comments.all

INSERT INTO "photos" ("created_at", "picture", "string", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-06-06 10:22:34.079220"], ["picture", ""], ["string", ""], ["updated_at", "2015-06-06 10:22:34.079220"]]
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save

UPDATE "photos" SET "picture" = ?, "updated_at" = ? WHERE "photos"."id" = 2  [["picture", "niebla_san_Francisco.jpg"], ["updated_at", "2015-06-06 10:48:28.332118"]]
---
  def update
    respond_to do |format|
      if @photo.update(photo_params)

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_photo
      @photo = Photo.find(params[:id])